# -*- org-src-preserve-indentation: t; org-edit-src-content: 0; -*-
#+TITLE: Supplementary II: Bayesian Model
#+AUTHOR: Rohit Goswami
#+EMAIL: rog32@hi.is
# This should not be altered
#+OPTIONS: toc:nil title:nil todo:nil
# I need the footnotes to be inlined
#+STARTUP: fninline

*** GP acceleration Algorithms
#+begin_src R :results value :colnames yes :post round-tbl[:colnames yes](*this*)
dfff %>% filter(success==TRUE, num_fragments < 3) -> dbrms_pes
dbrms_pes %>%
  group_by(method) %>%
  summarize(n=n(), mean=mean(pes_calls), median=median(pes_calls))
#+end_src

#+RESULTS[a60b960df868c78856061439a65182af0e71b44c]:
| method  |   n |  mean | median |
|---------+-----+-------+--------|
| Dimer   | 229 | 309.1 |    254 |
| GPDimer | 230 |  32.4 |     30 |
| OTGPD   | 233 |  29.0 |     28 |


#+begin_src R :results discard
brms_pes <- load_brms_model(
  file_path = "data/models/brms_pes.rds",
  formula = brmsformula(pes_calls ~ method + (1 | mol_id:spin)),
  data = dbrms_pes,
  family = negbinomial(link = "log"),
  prior = prior_list,
  chains = 4,
  iter = 4000,
  warmup = 1000,
  cores = 4,
  seed = 1995,
  backend = "cmdstanr"
)
#+end_src

#+RESULTS:

#+begin_src R :results output
summary(brms_pes)
#+end_src

#+RESULTS[38a37578ebaa408ec9da911f6e9d220e4ef01204]:
#+begin_example
 Family: negbinomial
  Links: mu = log
Formula: pes_calls ~ method + (1 | mol_id:spin)
   Data: data (Number of observations: 692)
  Draws: 4 chains, each with iter = 4000; warmup = 1000; thin = 1;
         total post-warmup draws = 12000

Multilevel Hyperparameters:
~mol_id:spin (Number of levels: 238)
              Estimate Est.Error l-95% CI u-95% CI Rhat Bulk_ESS Tail_ESS
sd(Intercept)     0.35      0.02     0.31     0.40 1.00     4042     7082

Regression Coefficients:
              Estimate Est.Error l-95% CI u-95% CI Rhat Bulk_ESS Tail_ESS
Intercept         5.61      0.03     5.55     5.67 1.00     6816     7994
methodGPDimer    -2.16      0.03    -2.22    -2.10 1.00    17086     9663
methodOTGPD      -2.26      0.03    -2.32    -2.20 1.00    16874     9285

Further Distributional Parameters:
      Estimate Est.Error l-95% CI u-95% CI Rhat Bulk_ESS Tail_ESS
shape    11.26      0.87     9.65    13.03 1.00     7688     8984

Draws were sampled using sample(hmc). For each parameter, Bulk_ESS
and Tail_ESS are effective sample size measures, and Rhat is the potential
scale reduction factor on split chains (at convergence, Rhat = 1).
#+end_example

#+begin_src R :results value :colnames yes :post round-tbl[:colnames yes](*this*)
param_draws_pes <- brms_pes %>%
  tidy_draws() %>%
  # Select fixed effects and random effect SD
  # get_variables(brms_pes)
  select(b_Intercept, b_methodGPDimer, b_methodOTGPD, `sd_mol_id:spin__Intercept`)

# --- 2. Calculate Summaries for Each Parameter Type ---

# 2a. Intercept (Expected Value)
summary_intercept <- param_draws_pes %>%
  mutate(response_value = exp(b_Intercept)) %>%
  summarize(
    median_val = median(response_value),
    lower_95 = quantile(response_value, 0.025),
    upper_95 = quantile(response_value, 0.975)
  ) %>%
  mutate(
    Effect_Type = "Expected PES Calls (Baseline: Dimer)",
    `Median Effect` = sprintf("%.1f", median_val),
    `95% CrI` = paste0("[", sprintf("%.1f", lower_95), ", ", sprintf("%.1f", upper_95), "]")
  ) %>%
  select(Effect_Type, `Median Effect`, `95% CrI`)

# 2b. GPDimer Effect (Multiplicative Factor AND Percentage Change)
summary_gpd <- param_draws_pes %>%
  mutate(
    mult_factor = exp(b_methodGPDimer),
    perc_change = (mult_factor - 1) * 100
  ) %>%
  summarize(
    median_mult = median(mult_factor),
    lower_mult = quantile(mult_factor, 0.025),
    upper_mult = quantile(mult_factor, 0.975),
    median_perc = median(perc_change),
    lower_perc = quantile(perc_change, 0.025),
    upper_perc = quantile(perc_change, 0.975)
  )

# Format Multiplicative Factor Row
formatted_gpd_mult <- summary_gpd %>%
  mutate(
    Effect_Type = "Multiplicative Factor (GPDimer vs Dimer)",
    `Median Effect` = sprintf("%.2f", median_mult), # Use more decimals for factor near 1
    `95% CrI` = paste0("[", sprintf("%.2f", lower_mult), ", ", sprintf("%.2f", upper_mult), "]")
  ) %>%
  select(Effect_Type, `Median Effect`, `95% CrI`)

# Format Percentage Change Row
formatted_gpd_perc <- summary_gpd %>%
  mutate(
    Effect_Type = "Percentage Change (GPDimer vs Dimer)",
    `Median Effect` = sprintf("%.1f%%", median_perc), # Add percent sign
    `95% CrI` = paste0("[", sprintf("%.1f%%", lower_perc), ", ", sprintf("%.1f%%", upper_perc), "]") # Add percent signs
  ) %>%
  select(Effect_Type, `Median Effect`, `95% CrI`)


# 2c. OTGPD Effect (Multiplicative Factor AND Percentage Change)
summary_otgpd <- param_draws_pes %>%
  mutate(
    mult_factor = exp(b_methodOTGPD),
    perc_change = (mult_factor - 1) * 100
  ) %>%
  summarize(
    median_mult = median(mult_factor),
    lower_mult = quantile(mult_factor, 0.025),
    upper_mult = quantile(mult_factor, 0.975),
    median_perc = median(perc_change),
    lower_perc = quantile(perc_change, 0.025),
    upper_perc = quantile(perc_change, 0.975)
  )

# Format Multiplicative Factor Row
formatted_otgpd_mult <- summary_otgpd %>%
  mutate(
    Effect_Type = "Multiplicative Factor (OTGPD vs Dimer)",
    `Median Effect` = sprintf("%.2f", median_mult), # Use more decimals for factor near 1
    `95% CrI` = paste0("[", sprintf("%.2f", lower_mult), ", ", sprintf("%.2f", upper_mult), "]")
  ) %>%
  select(Effect_Type, `Median Effect`, `95% CrI`)

# Format Percentage Change Row
formatted_otgpd_perc <- summary_otgpd %>%
  mutate(
    Effect_Type = "Percentage Change (OTGPD vs Dimer)",
    `Median Effect` = sprintf("%.1f%%", median_perc), # Add percent sign
    `95% CrI` = paste0("[", sprintf("%.1f%%", lower_perc), ", ", sprintf("%.1f%%", upper_perc), "]") # Add percent signs
  ) %>%
  select(Effect_Type, `Median Effect`, `95% CrI`)


# 2d. Random Effect SD
summary_sd <- param_draws_pes %>%
    select(sd_intercept_col = `sd_mol_id:spin__Intercept`) %>%
    summarize(
        median_sd = median(sd_intercept_col),
        lower_sd = quantile(sd_intercept_col, 0.025),
        upper_sd = quantile(sd_intercept_col, 0.975)
    ) %>%
  mutate(
    Effect_Type = "sd(Intercept) [mol_id:spin]",
    `Median Effect` = sprintf("%.2f", median_sd),
    `95% CrI` = paste0("[", sprintf("%.2f", lower_sd), ", ", sprintf("%.2f", upper_sd), "]")
  ) %>%
  select(Effect_Type, `Median Effect`, `95% CrI`)


# --- 3. Combine All Summaries ---
combined_summary_pes_full <- bind_rows(
  summary_intercept,
  formatted_gpd_mult,
  formatted_gpd_perc,
  formatted_otgpd_mult,
  formatted_otgpd_perc,
  summary_sd
) %>%
  # Optional: Set desired order
  mutate(Effect_Type = factor(Effect_Type, levels = c(
    "Expected PES Calls (Baseline: Dimer)",
    "Multiplicative Factor (GPDimer vs Dimer)",
    "Percentage Change (GPDimer vs Dimer)",
    "Multiplicative Factor (OTGPD vs Dimer)",
    "Percentage Change (OTGPD vs Dimer)",
    "sd(Intercept) [mol_id:spin]"
  ))) %>%
  arrange(Effect_Type)


# --- 4. Output ---
combined_summary_pes_full
#+end_src

#+RESULTS[79bc9834f331e043c0e76405afa79e5dc7090bfa]:
| Effect_Type                              | Median Effect | 95% CrI          |
|------------------------------------------+---------------+------------------|
| Expected PES Calls (Baseline: Dimer)     |         272.8 | [256.7, 289.9]   |
| Multiplicative Factor (GPDimer vs Dimer) |           0.1 | [0.11, 0.12]     |
| Percentage Change (GPDimer vs Dimer)     |        -88.4% | [-89.1%, -87.7%] |
| Multiplicative Factor (OTGPD vs Dimer)   |           0.1 | [0.10, 0.11]     |
| Percentage Change (OTGPD vs Dimer)       |        -89.6% | [-90.2%, -88.9%] |
| sd(Intercept) [mol_id:spin]              |           0.3 | [0.31, 0.40]     |


Or more simply.

#+begin_src R :results value :colnames yes :post round-tbl[:colnames yes](*this*)
# --- 1. Extract and transform draws with tidybayes ---
# spread_draws gets the posterior draws for each parameter into a clean format
effect_draws <- brms_pes %>%
  spread_draws(b_Intercept, b_methodGPDimer, b_methodOTGPD) %>%
  mutate(
    # Transform the Intercept to expected PES calls
    `Expected PES Calls (Dimer)` = exp(b_Intercept),
    # Transform the coefficients to percentage change
    `Percentage Change (GPDimer vs Dimer)` = (exp(b_Intercept + b_methodGPDimer) / exp(b_Intercept) - 1) * 100,
    `Percentage Change (OTGPD vs Dimer)` = (exp(b_Intercept + b_methodOTGPD) / exp(b_Intercept) - 1) * 100
  )

# --- 2. Calculate medians and credible intervals ---
# Select the transformed variables and calculate the median and 95% HDI
summary_table <- effect_draws %>%
  select(starts_with("Expected"), starts_with("Percentage")) %>%
  pivot_longer(everything(), names_to = "Effect", values_to = "value") %>%
  group_by(Effect) %>%
  median_hdi(.width = 0.95)

print(summary_table)
#+end_src

#+RESULTS[f6a6ad221ffe2d67c74b5c00c2549713bea93f5b]:
| Effect                               | value | .lower | .upper | .width | .point | .interval |
|--------------------------------------+-------+--------+--------+--------+--------+-----------|
| Expected PES Calls (Dimer)           | 272.8 |  256.8 |  290.0 |    0.9 | median | hdi       |
| Percentage Change (GPDimer vs Dimer) | -88.4 |  -89.1 |  -87.7 |    0.9 | median | hdi       |
| Percentage Change (OTGPD vs Dimer)   | -89.6 |  -90.2 |  -88.9 |    0.9 | median | hdi       |

** Total time models
Keep the systems which converge to the same saddles since otherwise the time measure makes no sense.

#+begin_src R :results value :colnames yes :post round-tbl[:colnames yes](*this*)
dbrms_time <- find_matching_saddles_all(dfff, "method", levels(dfff$method)) %>% filter(num_fragments < 3) %>% mutate(log_pes_calls=log(pes_calls), num_fragments_factor = as.factor(num_fragments))
dbrms_time %>%
  group_by(method) %>%
  summarize(n = n(), mean = mean(tot_time), median = median(tot_time))
#+end_src

#+RESULTS[c8555335e9948d4796a64d1892a76af8eb551686]:
| method  |   n | mean | median |
|---------+-----+------+--------|
| Dimer   | 163 | 21.0 |   18.4 |
| GPDimer | 163 | 16.6 |    7.8 |
| OTGPD   | 163 | 11.1 |    6.7 |

Now some EDA.

#+begin_src R :eval never
ggpairs(
  dbrms_time %>% select(-system_id,-spin,-mol_id,-fragment_sizes,-success,-iter_steps,-dimer_rot,-dimer_trans,-termination_status) %>% mutate(num_fragments=as.factor(num_fragments)),
  aes(color = method, alpha = 0.5),
  lower = list(continuous = wrap("points", size = 0.5)),
  upper = list(continuous = wrap("cor", size = 3))
)
#+end_src

#+begin_src R :eval never
prior_list_time <- c(
  prior(normal(0, 1), class = "b"),  # Weakly informative prior for fixed effects
  prior(student_t(3, 0, 2.5), class = "Intercept"), # Prior for intercept
  prior(exponential(1), class = "sd"),  # Prior for random effect SD
  prior(exponential(1), class = "shape") # Prior for the gamma shape parameter
)
brms_ttime <- load_brms_model(
  file_path = "data/models/brms_ttime.rds",
  formula = bf(tot_time ~ method + (1 | mol_id:spin)),
  data = dfff %>% filter(success==TRUE),
  family = Gamma(link = "log"),
  prior = prior_list_time,
  chains = 4,
  iter = 4000,
  warmup = 1000,
  cores = 4,
  seed = 1995,
  control = list(adapt_delta = 0.99, max_treedepth = 15),
  backend = "cmdstanr"
)
#+end_src

#+RESULTS[0c8b13a3c84d00b697c557764b7c519509f8d3e0]:

#+begin_src R
# Define the priors, including the essential one for the spline (sds)
prior_spline <- c(
  prior(normal(0, 1), class = "sds"), # Controls spline "wiggliness"
  prior(normal(0, 1), class = "b"),
  prior(student_t(3, 0, 2.5), class = "Intercept"),
  prior(exponential(1), class = "sd"),
  prior(exponential(1), class = "shape")
)

# Fit the spline model
# This will take longer than the polynomial model, but it's doing more work.
brms_ttime_spline <- load_brms_model(
  file_path = "data/models/brms_ttime_spline.rds",
  formula = bf(tot_time ~ method + s(log_pes_calls, by = method, k = 5) + (1 | mol_id:spin)),
  data = dfff %>% filter(success==TRUE) %>% mutate(log_pes_calls=log(pes_calls)),
  family = Gamma(link = "log"),
  prior = prior_spline,
  chains = 4,
  iter = 4000,
  warmup = 1000,
  cores = 4,
  seed = 1995,
  backend = "cmdstanr",
  control = list(adapt_delta = 0.99, max_treedepth = 15)
)
#+end_src

#+begin_src R
otgpd_max_log <- log(136)
gpd_max_log <- log(172)


# --- Step 2: Extract prediction data (THE EFFICIENT WAY) ---
# We run conditional_effects WITHOUT spaghetti = TRUE
prediction_list <- conditional_effects(brms_ttime_spline, effects = "log_pes_calls:method")

# The resulting object is a list, and the first element is our data frame
plot_data <- prediction_list$`log_pes_calls:method`


# --- Step 3: Define extrapolation zones (same as before) ---
plot_data <- plot_data %>%
  mutate(
    line_type = case_when(
      method == "Dimer" ~ "Solid",
      method == "GPDimer" & log_pes_calls <= gpd_max_log ~ "Solid",
      method == "GPDimer" & log_pes_calls > gpd_max_log ~ "Dotted",
      method == "OTGPD" & log_pes_calls <= otgpd_max_log ~ "Solid",
      method == "OTGPD" & log_pes_calls > otgpd_max_log ~ "Dotted",
      TRUE ~ "Solid"
    )
  )

# --- Step 4: Calculate binned medians of raw data (same as before) ---
median_data <- dbrms_time %>%
  mutate(log_pes_bin = cut(log_pes_calls, breaks = 200)) %>%
  group_by(method, log_pes_bin) %>%
  summarise(
    median_tot_time = median(tot_time),
    log_pes_calls = median(log_pes_calls)
  ) %>%
  ungroup()

mean_data <- dbrms_time %>%
  mutate(log_pes_bin = cut(log_pes_calls, breaks = 200)) %>%
  group_by(method, log_pes_bin) %>%
  summarise(
    # Use mean() instead of median()
    mean_tot_time = mean(tot_time),
    log_pes_calls = median(log_pes_calls)
  ) %>%
  ungroup()

# --- Step 5: Build the final plot (same as before) ---
ggplot(plot_data, aes(x = log_pes_calls, y = estimate__, color = method, fill = method)) +
  geom_ribbon(aes(ymin = lower__, ymax = upper__), alpha = 0.2, color = NA) +
  geom_line(aes(linetype = line_type), size = 1) +
  geom_point(data = mean_data, aes(y = mean_tot_time), size = 2, alpha = 0.8) +
  scale_linetype_manual(values = c("Solid" = 1, "Dotted" = 3), name = "Prediction Type") +
  coord_cartesian(xlim = c(min(dbrms_time$log_pes_calls), gpd_max_log + 0.5), ylim = c(0, 100)) +
  labs(
    title = "Model Predictions vs. Binned Means",
    subtitle = "Dotted lines indicate extrapolation beyond the method's observed maximum",
    x = "log(PES Calls)",
    y = "Total Time"
  ) +
  theme_minimal() +
  guides(linetype = "none")
#+end_src

#+RESULTS[86fcf3a3e4395b724fa9d35ae9c4c1208840858d]:

#+begin_src R :results output
summary(brms_ttime_spline)
#+end_src

#+RESULTS[82b8927f1e078c702c36644cebc593a5a9a014a1]:
#+begin_example
 Family: gamma
  Links: mu = log
Formula: tot_time ~ method + s(log_pes_calls, by = method, k = 5) + (1 | mol_id:spin)
   Data: data (Number of observations: 1433)
  Draws: 4 chains, each with iter = 4000; warmup = 1000; thin = 1;
         total post-warmup draws = 12000

Smoothing Spline Hyperparameters:
                                   Estimate
sds(slog_pes_callsmethodDimer_1)       2.44
sds(slog_pes_callsmethodGPDimer_1)     3.79
sds(slog_pes_callsmethodOTGPD_1)       4.15
                                   Est.Error
sds(slog_pes_callsmethodDimer_1)        0.51
sds(slog_pes_callsmethodGPDimer_1)      0.52
sds(slog_pes_callsmethodOTGPD_1)        0.51
                                   l-95% CI
sds(slog_pes_callsmethodDimer_1)       1.56
sds(slog_pes_callsmethodGPDimer_1)     2.87
sds(slog_pes_callsmethodOTGPD_1)       3.22
                                   u-95% CI Rhat
sds(slog_pes_callsmethodDimer_1)       3.53 1.00
sds(slog_pes_callsmethodGPDimer_1)     4.89 1.00
sds(slog_pes_callsmethodOTGPD_1)       5.24 1.00
                                   Bulk_ESS
sds(slog_pes_callsmethodDimer_1)       8533
sds(slog_pes_callsmethodGPDimer_1)    10689
sds(slog_pes_callsmethodOTGPD_1)      12370
                                   Tail_ESS
sds(slog_pes_callsmethodDimer_1)       6729
sds(slog_pes_callsmethodGPDimer_1)     7913
sds(slog_pes_callsmethodOTGPD_1)       8356

Multilevel Hyperparameters:
~mol_id:spin (Number of levels: 499)
              Estimate Est.Error l-95% CI u-95% CI
sd(Intercept)     0.39      0.02     0.35     0.42
              Rhat Bulk_ESS Tail_ESS
sd(Intercept) 1.00     3036     6241

Regression Coefficients:
                               Estimate Est.Error
Intercept                          2.71      0.12
methodGPDimer                      1.15      0.22
methodOTGPD                       -0.11      0.28
slog_pes_calls:methodDimer_1       1.51      0.95
slog_pes_calls:methodGPDimer_1     0.44      1.00
slog_pes_calls:methodOTGPD_1       0.22      1.00
                               l-95% CI u-95% CI
Intercept                          2.48     2.94
methodGPDimer                      0.72     1.58
methodOTGPD                       -0.67     0.44
slog_pes_calls:methodDimer_1      -0.33     3.38
slog_pes_calls:methodGPDimer_1    -1.54     2.40
slog_pes_calls:methodOTGPD_1      -1.74     2.16
                               Rhat Bulk_ESS
Intercept                      1.00    10213
methodGPDimer                  1.00     7315
methodOTGPD                    1.00     7428
slog_pes_calls:methodDimer_1   1.00    13657
slog_pes_calls:methodGPDimer_1 1.00    19482
slog_pes_calls:methodOTGPD_1   1.00    19934
                               Tail_ESS
Intercept                          9335
methodGPDimer                      8663
methodOTGPD                        7717
slog_pes_calls:methodDimer_1       9152
slog_pes_calls:methodGPDimer_1     8434
slog_pes_calls:methodOTGPD_1       9243

Further Distributional Parameters:
      Estimate Est.Error l-95% CI u-95% CI Rhat
shape     7.73      0.36     7.04     8.47 1.00
      Bulk_ESS Tail_ESS
shape     6529     8211

Draws were sampled using sample(hmc). For each parameter, Bulk_ESS
and Tail_ESS are effective sample size measures, and Rhat is the potential
scale reduction factor on split chains (at convergence, Rhat = 1).
#+end_example


Which we summarised by:

#+begin_src R :results value :colnames yes :post round-tbl[:colnames yes](*this*)
# --- Step 1: Define the scenarios for comparison ---
# We'll compare the expected total time for each method at 30 PES calls.
comparison_df <- tibble(
  pes_calls = 30,
  log_pes_calls = log(pes_calls),
  method = c("Dimer", "GPDimer", "OTGPD"),
  # A placeholder is needed for the group, but we'll ignore it
  # to get the population-level prediction.
  `mol_id:spin` = "s_001singlets"
)

# --- Step 2: Get posterior predictions and summarize ---
# `add_epred_draws` gets the expected predictions for our scenarios.
# `re_formula = NA` tells brms to ignore random effects.
time_predictions <- brms_ttime_spline %>%
  add_epred_draws(newdata = comparison_df, re_formula = NA) %>%
  # Summarize the posterior draws for each method
  group_by(method) %>%
  summarise(
    median_time = median(.epred),
    lower_95 = quantile(.epred, 0.025),
    upper_95 = quantile(.epred, 0.975)
  )

# --- Step 3: Calculate percentage differences relative to the Dimer method ---
# We need the Dimer's median time as a baseline for comparison
baseline_time <- time_predictions %>%
  filter(method == "Dimer") %>%
  pull(median_time)

# Calculate percentage change for the other methods
percentage_summary <- time_predictions %>%
  filter(method != "Dimer") %>%
  mutate(
    perc_change = (median_time - baseline_time) / baseline_time * 100
  )

# --- Step 4: Format and combine for the final table ---
# Format the main time predictions
formatted_times <- time_predictions %>%
  mutate(
    Effect_Type = paste0("Expected Time (min) @ 30 PES Calls (", method, ")"),
    `Median Effect` = sprintf("%.1f", median_time),
    `95% CrI` = paste0("[", sprintf("%.1f", lower_95), ", ", sprintf("%.1f", upper_95), "]")
  ) %>%
  select(Effect_Type, `Median Effect`, `95% CrI`)

# Format the percentage change predictions
formatted_percentages <- percentage_summary %>%
  mutate(
    Effect_Type = paste0("Percentage Change vs Dimer @ 30 PES Calls (", method, ")"),
    `Median Effect` = sprintf("%.1f%%", perc_change),
    `95% CrI` = "N/A" # Credible intervals for ratios are more complex; median is robust
  ) %>%
  select(Effect_Type, `Median Effect`, `95% CrI`)

# Combine into the final table
final_summary_spline <- bind_rows(
  formatted_times,
  formatted_percentages
) %>%
  arrange(Effect_Type)

# Print the final table
print(final_summary_spline)
#+end_src

#+RESULTS[a95bd35dbf65438614f5d3c2b4e6e8930a8bd66b]:
| Effect_Type                                         | Median Effect | 95% CrI      |
|-----------------------------------------------------+---------------+--------------|
| Expected Time (min) @ 30 PES Calls (Dimer)          |          11.5 | [8.1, 16.4]  |
| Expected Time (min) @ 30 PES Calls (GPDimer)        |          12.8 | [12.2, 13.5] |
| Expected Time (min) @ 30 PES Calls (OTGPD)          |          11.3 | [10.8, 11.9] |
| Percentage Change vs Dimer @ 30 PES Calls (GPDimer) |         12.0% | N/A          |
| Percentage Change vs Dimer @ 30 PES Calls (OTGPD)   |         -1.2% | N/A          |


Or much more reasonably, using the median of the calls per method:

#+begin_src R :results value :colnames yes :post round-tbl[:colnames yes](*this*)
convergence_scenarios <- tibble(
  method = c("Dimer", "GPDimer", "OTGPD"),
  pes_calls = c(254, 30, 28) # Using the medians from your benchmark
) %>%
  mutate(log_pes_calls = log(pes_calls))

# --- Step 2: Get posterior predictions for these realistic scenarios ---
time_at_convergence <- brms_ttime_spline %>%
  add_epred_draws(newdata = convergence_scenarios, re_formula = NA) %>%
  # Summarize the posterior draws for each method's typical run
  group_by(method, pes_calls) %>%
  summarise(
    median_time = median(.epred),
    lower_95 = quantile(.epred, 0.025),
    upper_95 = quantile(.epred, 0.975),
    .groups = "drop"
  )

# --- Step 3: Format the final table ---
final_summary_realistic <- time_at_convergence %>%
  mutate(
    `Median PES Calls` = pes_calls,
    `Expected Time-to-Solution (min)` = sprintf("%.1f", median_time),
    `95% CrI` = paste0("[", sprintf("%.1f", lower_95), ", ", sprintf("%.1f", upper_95), "]")
  ) %>%
  select(Method = method, `Median PES Calls`, `Expected Time-to-Solution (min)`, `95% CrI`) %>%
  arrange(desc(`Expected Time-to-Solution (min)`))

# Print the final, more meaningful table
print(final_summary_realistic)
#+end_src

#+RESULTS[48de7ba5ba3d59b37630ee3d5057b4aa48ab5614]:
| Method  | Median PES Calls | Expected Time-to-Solution (min) | 95% CrI      |
|---------+------------------+---------------------------------+--------------|
| OTGPD   |               28 |                             9.0 | [8.6, 9.5]   |
| Dimer   |              254 |                            20.5 | [19.2, 21.8] |
| GPDimer |               30 |                            12.8 | [12.2, 13.5] |

